Tekla Open API Reference for Tekla Structures 2025
DrawingItemEnumerator.Current Property
 Returns a drawing item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingItem Current { get; }
Public ReadOnly Property Current As DrawingItem
	Get
Property Value
Type: DrawingItem
See Also
Reference
DrawingItemEnumerator Class
Tekla.Structures.Catalogs Namespace